# To perform simple linear regression

Stastical Description

In [ ]:
#Name:-Vihal V. Karhade
#Roll No:- 38
#sec:-A (CSE) 3rd Year
#Sub:-Data Science

In [27]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [1]:
import os

In [2]:
os.getcwd()

'C:\\Users\\HP'

In [25]:
os.chdir("c:\\users\\hp\\desktop")

In [28]:
df=pd.read_csv("Salary (1).csv")

In [14]:
a=[10,20,30,40]

In [15]:
type(a)

list

In [16]:
len(a)

4

In [17]:
a[3]

40

In [18]:
a[-1]

40

In [21]:
a[1:3]

[20, 30]

In [22]:
a[1:4]

[20, 30, 40]

In [29]:
df.tail()

    YearsExperience  Salary
30             11.2  127345
31             11.5  126756
32             12.3  128765
33             12.9  135675
34             13.5  139465

In [30]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [31]:
df.head(30)

    YearsExperience  Salary
0               1.1   39343
1               1.3   46205
2               1.5   37731
3               2.0   43525
4               2.2   39891
5               2.9   56642
6               3.0   60150
7               3.2   54445
8               3.2   64445
9               3.7   57189
10              3.9   63218
11              4.0   55794
12              4.0   56957
13              4.1   57081
14              4.5   61111
15              4.9   67938
16              5.1   66029
17              5.3   83088
18              5.9   81363
19              6.0   93940
20              6.8   91738
21              7.1   98273
22              7.9  101302
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  35 non-null     float64
 1   Salary           35 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 688.0 bytes

In [34]:
df.describe()

       YearsExperience         Salary
count        35.000000      35.000000
mean          6.308571   83945.600000
std           3.618610   32162.673003
min           1.100000   37731.000000
25%           3.450000   57019.000000
50%           5.300000   81363.000000
75%           9.250000  113223.500000
max          13.500000  139465.000000

In [35]:
df.shape

(35, 2)

In [36]:
df.size

70

In [37]:
df.ndim

2

In [38]:
df.isnull().sum()

YearsExperience    0
Salary             0
dtype: int64

In [40]:
df.isnull().sum()

YearsExperience    0
Salary             0
dtype: int64